# vsoSetObjToolName

## Description
Set ToolName for similar object creation. Used inside ParametricGetToolNameMessage::kAction event.

```pascal
PROCEDURE vsoSetObjToolName(
				eventData : LONGINT;
				toolName  : STRING);
```

```python

def vs.vsoSetObjToolName(eventData, toolName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|eventData|LONGINT||
|toolName|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events